package by.jonline.task1.main;

public class Number02 {
	
	// Найдите значение выражения с = 3 + a

	public static void main(String[] args) {
		
		double a;
		
		a = 157;
		
		double c;
		
		c = 3 + a;
		
		System.out.println("При a = " + a + " значение выражения равно " + c);

	}

}
